# TransformModel Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisDetailModel..::..TransformModel Method
EnergyAnalysisDetailModel Class See Also
---
Transforms all surfaces in the model according to the document's active ground plane, shared coordinates and true north.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void TransformModel()
```

Visual Basic
---
```text
Public Sub TransformModel
```

Visual C++
---
```text
public:
void TransformModel()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This operation failed. |

# See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace